[{"description": "\n        Take away the special effects and Avengers: Endgame looks a lot different but no less fun to be a part of.\n      ", "link": "https://twitter.com/i/moments/1128118582406144001"}, {"description": "\n        A mid-air crash of two floatplanes near Ketchikan, Alaska has left five people dead, according to Princess Cruises. A total of 16 people were on the planes and so far at least nine has been rescued.\n      ", "link": "https://twitter.com/i/moments/1128114923450425344"}, {"description": "\n        A California jury on Monday awarded a historic $2.055-billion verdict against agribusiness giant Monsanto Co. in a case brought forward by a couple who claimed that the company’s weed killer Roundup caused their cancers. This is the third such courtroom loss for Monsanto in California since August.\n      ", "link": "https://twitter.com/i/moments/1128099646377578496"}, {"description": "\n        The children's show kicked off its 22nd season on May 13 with an episode which revealed that Arthur's teacher Mr Ratburn is gay.\n      ", "link": "https://twitter.com/i/moments/1128053418226999296"}, {"description": "\n        Put the speculation to rest. The WWE stars confirmed their relationship once and for all on social media.\n      ", "link": "https://twitter.com/i/moments/1128048972067680256"}, {"description": "\n        Nike released a statement following The New York Times' opinion piece on the company's maternity leave policy, which has affected many sponsored athletes including US track and field star Alysia Montaño.\n      ", "link": "https://twitter.com/i/moments/1127989381577498625"}, {"description": "\n        Journalist Jeff Weiss spoke to 25-year-old Darrell \"Drakeo the Ruler\" Caldwell, who's currently in Los Angeles Men's Central Jail awaiting a May trial on charges of first-degree murder, attempted murder and several counts of conspiracy to commit murder. In a series of Tweets, Weiss described Drakeo's case as everything \"morally reprehensible\" and \"systematically racist\" about the US criminal justice system.\n      ", "link": "https://twitter.com/i/moments/1128061592468369408"}, {"description": "\n        UEFA investigators are recommending the Premier League club be banned from the Champions League for one year. Manchester City are being investigated for allegedly breaching financial fair play regulations.\n      ", "link": "https://twitter.com/i/moments/1128015282163863564"}, {"description": "\n        Apple fans rejoice: updates are here. The technology giant released iOS 12.3, watchOS 5.2.1, macOS Mojave 10.14.5 and tvOS 12.3, as well as a new TV app with a video subscription feature called Channels.\n      ", "link": "https://twitter.com/i/moments/1128048075287568384"}, {"description": "\n        After a solid 90 minutes or so of pure destruction on Game of Thrones, we need a breather from the madness of the penultimate episode. Perhaps the writers felt the same, because after that brutal sack on King's Landing, we got a lengthy quiet scene.\n      ", "link": "https://twitter.com/i/moments/1127924246754287618"}, {"description": "\n        Ohtani hit a 429-foot bomb to left center off pitcher José Berríos to give the Angels the lead against the Twins.\n      ", "link": "https://twitter.com/i/moments/1128101169547677697"}, {"description": "\n        X-Men Day is being celebrated by fans of the franchise as they prepare for the culminating release of the Dark Phoenix film. In celebration of the day, former Wolverine star Hugh Jackman and Deadpool's Ryan Reynolds reflected on their roles.\n      ", "link": "https://twitter.com/i/moments/1128026878252605440"}, {"description": "\n        The Sharks attack proved too much for the Blues in Game 1. Can St. Louis rebound and even the series? Keep it here for highlights and updates once the puck drops.\n      ", "link": "https://twitter.com/i/moments/1128090205745848320"}, {"description": "\n        \"There will be some sacrifice on the part of Americans, I grant you that. But also that sacrifice is pretty minimal compared to the sacrifices that our soldiers make overseas that are fallen heroes or laid to rest,\" the Republican senator said addressing the higher duties imposed on China by President Trump.\n      ", "link": "https://twitter.com/i/moments/1128003164458844162"}, {"description": "\n        American explorer Victor Vescovo has set a new record in what Five Deeps Expedition claims to be the success of its \"fourth dive to the deepest point on the planet.\"\n      ", "link": "https://twitter.com/i/moments/1127999614110568449"}, {"description": "\n        While all the action played out onscreen, an NFL star managed to make a quick cameo before suffering the tragic same fate as most of King's Landing.\n      ", "link": "https://twitter.com/i/moments/1127932774910971905"}, {"description": "\n        Tlaib’s response to a question about a one-state solution to the Israeli-Palestinian conflict became a target for critics, regarding the historical accuracy as well as the words she used. Tlaib defended her remarks saying critics are “twisting” her words out of context to be used against her.\n      ", "link": "https://twitter.com/i/moments/1127987376020758528"}, {"description": "\n        Sources told @AndySlater that Jackson tried to enter the Rolling Loud VIP section multiple times without a proper pass. After being handcuffed by police, Jackson reportedly took off running. He was charged with escape and resisting arrest.\n      ", "link": "https://twitter.com/i/moments/1128008836940431360"}, {"description": "\n SPOILERS AHEAD A massive shift in a Targaryen's character arc on the latest episode has left fans with some burning questions.\n      ", "link": "https://twitter.com/i/moments/1127887454512480256"}, {"description": "\n        The Democratic presidential candidate pledged that she will choose a former public school teacher to serve as her education secretary. Warren went on to critique Betsy DeVos, Tweeting, \"Appointed despite her conflicts of interest, she's spent her time protecting for-profit colleges that break the law and cheat students.\"\n      ", "link": "https://twitter.com/i/moments/1128028024648159232"}]